Repository: toscawidgets/tw2.core
Catalog: tw2/core/i18n/*/LC_MESSAGES/tw2core.po
Languages: de, es, fr, it, nl, ru, uk

source: Enter a value
de: Bitte einen Wert eingeben
es: Introducir un valor
fr: Saisissez une valeur
it: Inserisci un valore
nl: Waarde invoeren
ru: Введите значение
uk: Введіть значення

source: Received in wrong character set; should be $encoding
de: In falschem Zeichensatz empfangen; sollte $encoding sein
es: Recibido en juego de caracteres incorrecto, debería ser $encoding
fr: Reçu en jeu de caractères incorrect; doit être $encoding
it: Ricevuto nel set di caratteri errato; dovrebbe essere $encoding
nl: Ontvangen in de verkeerde tekenset; moet $encoding
ru: Пришло в неправильном наборе символов; должно быть $encoding
uk: Прийшло в неправильному наборі символів; повинно бути $encoding

source: Form submission received corrupted; please try again
de: Formulardaten wurden nicht richtig empfangen; bitte noch einmal versuchen
es: Los datos del formulario recibido dañado, por favor inténtelo de nuevo
fr: Soumission du formulaire reçu corrompue; s'il vous plaît essayer à nouveau
it: Invio del modulo ricevuto danneggiato, si prega di riprovare
nl: Vorm waarden ontvangen gebrek; probeer het opnieuw
ru: Прошла неисправная передача формы; пожалуйста, попробуйте еще раз
uk: Форма подання прийшла пошкодженою, спробуйте ще раз

source: Value is too short
de: Wert ist zu kurz
es: El valor es demasiado corto
fr: Valeur est trop court
it: Il valore è troppo breve
nl: Waarde is te kort
ru: Слишком короткое значение
uk: Занадто коротке значення

source: Value is too long
de: Wert ist zu lang
es: El valor es demasiado largo
fr: Valeur est trop longue
it: Il valore è troppo lungo
nl: Waarde is te lang
ru: Слишком длинное значение
uk: Занадто довге значення

source: Must be at least $min characters
de: Muss mindestens $min Zeichen haben
es: Debe tener al menos $min caracteres
fr: Doit avoir au moins $min caractères
it: Deve essere di almeno 3 caratteri
nl: Moet ten minste $min karakters
ru: Должно быть не меньше чем $min символов
uk: Повинно бути не менше $min символів

source: Cannot be longer than $max characters
de: Darf nicht mehr als $max Zeichen haben
es: No pueden tener más de $max caracteres
fr: Ne doit pas dépasser $max caractères
it: Non può essere più lungo di $max caratteri
nl: Mag niet langer zijn dan $max karakters
ru: Должно быть не больше чем $max символов
uk: Повинно бути не більше $max символів

source: Select at least $min
de: Wählen Sie mindestens $min
es: Seleccione por lo menos $min
fr: Choisissez au moins $min
it: Selezionare almeno $min
nl: Selecteer ten minste $min
ru: Выберите не менее чем $min
uk: Вибрати не меньше ніж $min

source: Select no more than $max
de: Wählen Sie höchstens $max
es: Seleccione no más de $max
fr: Choisissez au plus $max
it: Selezionare non più di $max
nl: Selecteer niet meer dan $max
ru: Выберите не более чем $max
uk: Вибрати не більше ніж $max

source: Must be at least $min
de: Muss mindestens $min sein
es: Debe tener al menos $min
fr: Doit être d'au moins $min
it: Deve essere almeno $min
nl: Moet ten minste $min
ru: Должно быть не меньше чем $min
uk: Повинно бути не менше $min

source: Cannot be more than $max
de: Darf höchstens $max sein
es: No puede ser más de $max
fr: Ne doit pas être plus de $max
it: Non può essere più di $max
nl: Kan niet meer dan $max
ru: Должно быть не больше чем $max
uk: Повинно бути не більше $max

source: Must be an integer
de: Muss eine ganze Zahl sein
es: Debe ser un entero
fr: Doit être un entier
it: Deve essere un numero intero
nl: Moet een geheel getal zijn
ru: Введите целое число
uk: Введіть ціле число

source: You must select this
de: Sie müssen dies auswählen
es: Debe seleccionar esta
fr: Vous devez sélectionner ceci
it: È necessario selezionare un valore
nl: U moet dit selecteren
ru: Необходимо выбрать это
uk: Необхідно вибрати це

source: Invalid value
de: Ungültiger Wert
es: Valor no válido
fr: Valeur incorrecte
it: Valore non valido
nl: Ongeldige waarde
ru: Неправильное значение
uk: Невірне значення

source: Must follow date format $format_str
de: Muss dem Datumsformat $format_str entsprechen
es: Debe seguir el formato de fecha $format_str
fr: Doit respecter le format de date $format_str
it: Deve seguire il formato data $format_str
nl: Moet volgen datumnotatie $format_str
ru: Введите дату в виде $format_str
uk: Введіть дату у вигляді $format_str

source: Cannot be earlier than $min_str
de: Darf nicht früher als $min_str sein
es: No puede ser antes de $min_str
fr: Ne peut pas être antérieure à $min_str
it: Non può essere anteriore a $min_str
nl: Kan niet eerder zijn dan $min_str
ru: Не должно быть раньше чем $min_str
uk: Не може бути раніше ніж $min_str

source: Cannot be later than $max_str
de: Darf nicht später als $max_str sein
es: No puede ser después de $max_str
fr: Ne peut pas être postérieure à $max_str
it: Non può essere oltre $max_str
nl: Kan niet later vallen dan $max_str
ru: Не должно быть позже чем $max_str
uk: Не може бути пізніше ніж $max_str

source: Must follow date/time format $format_str
de: Muss dem Datums/Zeitformat $format_str entsprechen
es: Debe seguir el formato de fecha/hora $format_str
fr: Doit respecter le format de date/heure $format_str
it: Deve seguire il formato data e ora $format_str
nl: Moet volgen datum/tijdnotatie $format_str
ru: Введите дату/время в виде $format_str
uk: Введіть дату/час у вигляді $format_str

source: Must be a valid email address
de: Bitte eine gültige E-Mail-Adresse eing
es: Debe ser una dirección válida de email
fr: Veuillez entrer une adresse valide
it: Deve essere un indirizzo email valido
nl: Moet een geldig e-mailadres zijn
ru: Введите email адрес
uk: Введіть email адресу

source: Must be a valid URL
de: Bitte eine gültige URL eingeben
es: Debe ser una URL válida
fr: Veuillez entrer une URL valide
it: Deve essere un URL valido
nl: Moet een geldige URL zijn
ru: Введите верный URL
uk: Введіть дійсний URL

source: Must be a valid IP address
de: Bitte eine gültige IP-Adresse eingeben
es: Debe ser una dirección IP válida
fr: Veuillez entrer une adresse IP valide
it: Deve essere un indirizzo IP valido
nl: Moet een geldig IP-adres zijn
ru: Введите верный IP адрес
uk: Введіть дійсну IP-адресу

source: Must be a valid IP network block
de: Bitte einen gültigen IP-Netzwerkblock eingeben
es: Debe ser un bloque de direcciones IP de red válida
fr: Veuillez entrer un bloc des adresses IP valide
it: Deve essere un IP per un blocco di rete
nl: Moet een geldig IP netwerk blok zijn
ru: Введите верный IP блок сети
uk: Введіть дійсний IP блок мережі

source: Must match $other_field_str
de: Muss mit $other_field_str übereinstimmen
es: Debe coincidir con $other_field_str
fr: Doit correspondre à $other_field_str
it: Deve corrispondere a $other_field_str
nl: Moeten overeenkomen met $other_field_str
ru: Должно совпадать с $other_field_str
uk: Повинно співпадати з $other_field_str
